/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   vec_input.cpp                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kachiote <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/22 18:44:09 by kachiote          #+#    #+#             */
/*   Updated: 2020/09/22 18:44:09 by kachiote         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libvec.h"

void	vec_input(std::vector<int> &vc)
{
	int		a, m;

	std::cout << "кол-во элементов: " << "\n";
	std::cin >> m;
	std::cout << "массив: ";
	for(int j = 0; j < m; j++)
	{
		std::cin >> a;
		vc.push_back(a);
	}
}
